 #область ПрограммныйИнтерфейс 
 Процедура ДополнитьФорму(Форма) Экспорт
	 
	 ИмяФормы = Форма.ИмяФормы;
	 
	 Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		 ДобавитьВПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	 ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		 ДобавитьВПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	 ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		 ДобавитьВПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	 ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		 ДобавитьВПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
	 ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		 ДобавитьВПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);  
	 КонецЕсли
	 
 КонецПроцедуры
 #КонецОбласти
 
 #Область СлужебныйКомандныйИнтерфейс
 Процедура ДобавитьВПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	 ПолеВвода = Форма.Элементы.Вставить("АВ_КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаКолонкиШапки.ПодчиненныеЭлементы.ГруппаШапкаПраво);
	 ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	 ПолеВвода.ПутьКДанным = "Объект.АВ_КонтактноеЛицо";
 КонецПроцедуры
 Процедура ДобавитьВПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
	 ПолеВвода = Форма.Элементы.Вставить("АВ_КонтактноеЛицо", Тип("ПолеФормы"),Форма, Форма.Элементы.СуммаДокумента);
	 ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	 ПолеВвода.ПутьКДанным = "Объект.АВ_КонтактноеЛицо";
 КонецПроцедуры
 #КонецОбласти